БИТУправление_медицинским_центром_демо/src/Catalogs/ОбработкиSMSрассылки/ОбработкиSMSрассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбработкиSMSрассылки</name>
  <comment>Обработки SMS-рассылки</comment>
  <attributes>
    <name>КомментарийКФайлуИсточнику</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Зарегистрированный пользователь SMS</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль зарегистрированного пользователя SMS- сервиса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <comment>Подпись к SMS сообщениям</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеПараметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ОбработкиSMSрассылки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура СоздатьОбработкуОтправкиСМС
//
// Параметры:
//  Имя - Строка.
//  Пользователь - Строка - По умолчанию "".
//  Пароль - Строка - По умолчанию "".
//  Подпись - Строка - По умолчанию "".
//
Процедура СоздатьОбработкуОтправкиСМС(Имя, Пользователь = "", Пароль = "", Подпись = "") Экспорт
	
	Обработка = Справочники.ОбработкиSMSрассылки.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(Обработка, ПолучитьДанныеВстроеннойОбработкиРассылки(Имя));

	Обработка.Пользователь = Пользователь;
	Обработка.Пароль = Пароль;
	
	Попытка
		СведенияОбОбработке = Обработка.ПолучитьСведенияОВнешнейОбработкеСервер();	
		ПараметрыОбработки = СведенияОбОбработке.ДополнительныеПараметры;
		Обработка.ДополнительныеПараметры = Новый ХранилищеЗначения(ПараметрыОбработки);
	Исключение КонецПопытки;
		
	Обработка.Записать();
	
КонецПроцедуры

// Возвращает встроенную обработку по имени макета обработки в справочнике, а также наименование и описание источника.
// 
// Параметры:
// 	Имя - Строка -  Имя макета встроенной обработки в метаданных справочника.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьДанныеВстроеннойОбработкиРассылки(Имя) Экспорт
	
	Возврат	Новый Структура("Наименование, ХранилищеВнешнейОбработки, КомментарийКФайлуИсточнику",
							  ПустаяСсылка().Метаданные().Макеты[Имя].Синоним,
							  Новый ХранилищеЗначения(Справочники.ОбработкиSMSрассылки.ПолучитьМакет(Имя)),
							  "Исходный файл: Встроенная обработка рассылки");
	
КонецФункции

#КонецОбласти
